BaseConfiguration/Money_2_0/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ВычетыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВычетыФизическихЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобровольныеПенсионныеВзносыИСтрахованиеЖизни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущественный</Name>
					<Comment>Имущественный по доходам от продажи имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиционный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПриобретениеИлиСтроительствоНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профессиональный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Социальный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныйНаДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныйНаНалогоплательщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиПрошлыхЛетПоОперациямСЦеннымиБумагами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеоблагаемыеСуммы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/CommonModules/УчетНДФЛПредпринимателя/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Индивидуальный предприниматель"
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает дату начала применения схемы расчета авансовых платежей предпринимателем
// (п. 7 ст. 1 Федерального закона от 15.04.2019 N 63-ФЗ)
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаРасчетаАвансовыхПлатежейНДФЛ() Экспорт
	
	Возврат Дата('20200101');
	
КонецФункции

// Возвращает признак ввода начальных остатков по счету 68.21 - НДФЛ индивидуального предпринимателя
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация, по которой требуется проверить остатки по счету.
//
// Возвращаемое значение:
//   Булево
//
Функция НачальныеОстаткиПоНалогуВведены(Организация) Экспорт
	
	// ДЕНЬГИ
	Возврат Ложь;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Возвращает период, за который уплачивается налог.
//
// Параметры:
//  ПоказательПериода - Строка - Показатель периода платежа в бюджет.
//  ДатаПлатежа       - Дата - дата платежного документа.
//
// Возвращаемое значение:
//   Дата - начало квартала, за который уплачивается налог;
//          для налога за год - начало последнего квартала в году.
//
Функция НалоговыйПериодПоПлатежнымДанным(ПоказательПериода, ДатаПлатежа) Экспорт
	
	ОписаниеПериода = Деньги3НДФЛКлиентСервер.РазобратьНалоговыйПериод(ПоказательПериода);
	
	Если ОписаниеПериода.Периодичность = Деньги3НДФЛКлиентСервер.НезаполненноеЗначение() Тогда
		
		НалоговыйПериод = НачалоМесяца(ДобавитьМесяц(ДатаПлатежа, -1));
		
	ИначеЕсли ОписаниеПериода.Периодичность = Деньги3НДФЛКлиентСервер.ПериодичностьГод() Тогда
		
		НалоговыйПериод = НачалоКвартала(КонецГода(ОписаниеПериода.Дата));
		
	ИначеЕсли ОписаниеПериода.Периодичность = Деньги3НДФЛКлиентСервер.ПериодичностьПолугодие() Тогда
		
		НалоговыйПериод = НачалоКвартала(ДобавитьМесяц(ОписаниеПериода.Дата, 3));
		
	ИначеЕсли ОписаниеПериода.Периодичность = Деньги3НДФЛКлиентСервер.ПериодичностьКвартал()
		Или ОписаниеПериода.Периодичность = Деньги3НДФЛКлиентСервер.ПериодичностьМесяц() Тогда
		
		НалоговыйПериод = НачалоКвартала(ОписаниеПериода.Дата);
		
	Иначе
		
		НалоговыйПериод = ДатаПлатежа;
		
	КонецЕсли;
	
	Возврат НалоговыйПериод;
	
КонецФункции

// Определяет периодичность налогового платежа в зависимости от оплачиваемого периода.
//
// Параметры:
//  НалоговыйПериод - Дата - оплачиваемый период
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Периодичность, возможные значения:
//    * Год, если платеж за последний квартал (налог за год)
//    * Квартал, если платеж за все остальные кварталы (авансовый платеж).
Функция ПериодичностьНалоговогоПлатежа(НалоговыйПериод) Экспорт
	
	Если КонецКвартала(НалоговыйПериод) = КонецГода(НалоговыйПериод) Тогда
		// Платеж за последний квартал года - это налог за год.
		Возврат Перечисления.Периодичность.Год;
	Иначе
		// За периоды кроме последнего квартала года уплачивается ежеквартальный авансовый платеж.
		Возврат Перечисления.Периодичность.Квартал;
	КонецЕсли;
	
КонецФункции

// Возвращает наиболее вероятный период (квартал), за который уплачивается НДФЛ
//
// Параметры:
//   ДатаПлатежа - Дата - Дата платежа фактическая
//
// Возвращаемое значение:
//   Дата - начало квартала, за который выполняется платеж
//
Функция РелевантныйПериодНалоговогоПлатежа(ДатаПлатежа) Экспорт
	
	// Обработаем наиболее вероятные сценарии:
	// - до 15 июля - оплата налога за год
	// - в срок с начала апреля до 25 апреля - уплата авансового платежа
	// - после 15 июля - уплата авансового платежа
	
	ДеньУплатыАвансаПоУмолчанию = ДеньУплатыАвансовогоПлатежаПоУмолчанию();
	СрокУплатыНалогаЗаГод = СрокУплатыНалогаПоУмолчанию(ДобавитьМесяц(ДатаПлатежа, -12));
	
	Если Месяц(ДатаПлатежа) = 4 И День(ДатаПлатежа) <= ДеньУплатыАвансаПоУмолчанию Тогда
		
		НалоговыйПериод = НачалоКвартала(ДобавитьМесяц(ДатаПлатежа, -3));
		
	ИначеЕсли ДатаПлатежа < СрокУплатыНалогаЗаГод Тогда
		
		НалоговыйПериод = НачалоКвартала(НачалоГода(ДатаПлатежа) - 1);
		
	Иначе
		
		НалоговыйПериод = НачалоКвартала(ДобавитьМесяц(ДатаПлатежа, -3));
		
	КонецЕсли;
	
	Возврат НалоговыйПериод;
	
КонецФункции

// Возвращает календарный срок уплаты налога на доходы физических лиц
//
// Параметры:
//   Период - Дата - Дата в пределах года, за который определяется срок уплаты налога
//
// Возвращаемое значение:
//   Дата
//
Функция СрокУплатыНалогаПоУмолчанию(Период) Экспорт
	
	Возврат Дата(Год(Период) + 1, 07, 15);
	
КонецФункции

// Возвращает признак того, применяется ли освобождение от уплаты налога по НДФЛ
//
// Параметры:
//   Период      - Дата - Дата, для которой определяется освобождение от налога
//   Организация - СправочникСсылка.Организации - организация, для которой выполняется проверка освобождения от налога
//
// Возвращаемое значение:
//   Булево
//
Функция ПрименяетсяОсвобождениеОтНалога(Организация, Период) Экспорт
	
	// ДЕНЬГИ
	ГодПериода = Год(Период);
	Возврат ЗначениеЗаполнено(Период) И ГодПериода >= 2020;
	// Конец ДЕНЬГИ 
	
КонецФункции

#Область РасчетыПоНДФЛ

// Определяет сумму отраженных в бухгалтерском учете (уплаченных) платежей по налогу НДФЛ за указанный период.
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - Налогоплательщик.
//  НачалоПериода - Дата - Дата и время начала анализируемого периода.
//  КонецПериода  - Дата - Дата и время окончания анализируемого периода.
//
// Возвращаемое значение:
//  Число - сумма уплаченного налога (авансовых платежей).
//
Функция УплаченныйНалогЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	// ДЕНЬГИ
	Возврат 0;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Возвращает остаток расчетов по НДФЛ на конец периода.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - налогоплательщик.
//   Период      - Дата - Дата и время, на которую будет рассчитан остаток.
//
// Возвращаемое значение:
//   Число - остаток расчетов по налогу:
//           если отрицательный - имеется непогашенная задолженность;
//           если положительный - имеется переплата по налогу.
//
Функция ОстатокРасчетовПоНДФЛ(Организация, Период) Экспорт
	
	// ДЕНЬГИ
	Возврат 0;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Определяет остаток неоплаченного налога за периоды ранее переданного.
// Остаток определяется исходя изо всех оплат за прошлые налоговые периоды независимо от даты фактических платежей.
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - организация, для которой требуются сведения.
//  ТекущийПериод - Дата - дата в пределах налогового периода (года),
//                         на начало которого требуется остаток расчетов за прошлые годы.
//
// Возвращаемое значение:
//   Число - остаток расчетов по налогу:
//           если отрицательный - имеется непогашенная задолженность за прошлые годы;
//           если положительный - имеется переплата по налогу за прошлые годы.
//
Функция ОстатокРасчетовПоНалогуЗаПредыдущиеПериоды(Организация, ТекущийПериод) Экспорт
	
	// ДЕНЬГИ
	Возврат 0;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Получает развернутые по годам расчеты по налогу за налоговые периоды ранее переданного.
// Оплаченный налог за каждый год определяется исходя изо всех оплат, в которых указан период в пределах года,
// независимо от даты фактических платежей.
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - организация, для которой требуются сведения.
//  ТекущийПериод - Дата - дата в пределах налогового периода (года),
//                         на начало которого требуются данные расчетов за прошлые годы.
//
// Возвращаемое значение:
//   ТаблицаЗначений - развернутые по годам суммы расчетов по налогу, состав см. в НоваяТаблицаРасчетовПоНалогу().
//
Функция РасчетыПоНалогуЗаПредыдущиеПериоды(Организация, ТекущийПериод) Экспорт
	
	ТаблицаРасчетов = НоваяТаблицаРасчетовПоНалогу();
	
	// ДЕНЬГИ
	Возврат ТаблицаРасчетов;
	// Конец ДЕНЬГИ 
	
КонецФункции

#КонецОбласти

#Область НачислениеНДФЛ

// Описывает контекст, в котором выполняется расчет налога НФДЛ - организацию, период и т.п.
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - налогоплательщик.
//  ПериодРасчета - Дата - дата из последнего квартала отчетного периода, за который рассчитывается налог.
//
// Возвращаемое значение:
//  Структура    - состав см. в теле функции
//  Неопределено - расчет не имеет смысла: в указанный период организация еще не зарегистрирована, или не применяет НДФЛ,
//                 или же налог в данном периоде не исчисляется в силу п. 2 статьи 55 НК РФ.
//
Функция НовыйКонтекстРасчетаНалога(Организация, ПериодРасчета) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// ДЕНЬГИ
	Возврат Неопределено;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Определяет сумму отраженных в бухгалтерском учете начислений по НДФЛ за указанный период.
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - Налогоплательщик.
//  НачалоПериода - Дата - Дата и время начала анализируемого периода.
//  КонецПериода  - Дата - Дата и время окончания анализируемого периода.
//
// Возвращаемое значение:
//  Число - сумма уплаченного налога (авансовых платежей).
//
Функция НачисленныйНалогЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	// ДЕНЬГИ
	Возврат 0;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Возвращает таблицу отраженных в бухгалтерском учете (уплаченных) платежей по налогу НДФЛ за указанный период.
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - Налогоплательщик.
//  НачалоПериода - Дата - Дата и время начала анализируемого периода.
//  КонецПериода  - Дата - Дата и время окончания анализируемого периода.
//
// Возвращаемое значение:
//  ТаблицаЗначений - документы авансовых платежей.
//
Функция УплаченныйНалогЗаПериодПоДокументам(Организация, НачалоПериода, КонецПериода) Экспорт
	
	// ДЕНЬГИ
	Возврат 0;
	// Конец ДЕНЬГИ 
	
КонецФункции

// Рассчитывает налог НДФЛ по данным информационной базы и возвращает данные
// для отражения начисленного налога в проводках и во вспомогательных регистрах для справки-расчета.
//
// Параметры:
//  КонтекстРасчета - Структура - см. НовыйКонтекстРасчета().
//
// Возвращаемое значение:
//  Структура - содержит таблицы для отражения начисленного налога в бухучете и для формирования справки-расчета:
//     * ТаблицаПроводок       - ТаблицаЗначений - см. НалоговыйУчет.НоваяТаблицаНачисленияНалога()
//     * ТаблицаСправкиРасчета - ТаблицаЗначений - см. НоваяТаблицаСправкиРасчетаНалога()
//
Функция ПодготовитьТаблицыРасчетаНДФЛ(КонтекстРасчета) Экспорт
	
	ТаблицаПроводок       = Деньги3НДФЛ.НоваяТаблицаНачисленияНалога();
	ТаблицаСправкиРасчета = НоваяТаблицаСправкиРасчетаНалога();
	
	РассчитатьНДФЛ(КонтекстРасчета, ТаблицаПроводок, ТаблицаСправкиРасчета);
	
	РезультатРасчета = Новый Структура();
	РезультатРасчета.Вставить("ТаблицаПроводок",       ТаблицаПроводок);
	РезультатРасчета.Вставить("ТаблицаСправкиРасчета", ТаблицаСправкиРасчета);
	
	Возврат РезультатРасчета;
	
КонецФункции

// Выполняет запись движений в базу
//
// Параметры:
//   Проводки      - ТаблицаЗначений - Данные, необходимые для записи с РегистрБухгалтерии.Хозрасчетный
//   СправкаРасчет - ТаблицаЗначений - Данные, необходимые для записи в РегистрСведений.ИПРасчетНДФЛ
//   Реквизиты     - ТаблицаЗначений - Реквизиты регламентной операции
//   Движения      - КоллекцияДвижений - Движения регламентной операции
//
// Возвращаемое значение:
Процедура СформироватьДвиженияНачислениеНДФЛ(Проводки, СправкаРасчет, Реквизиты, Движения) Экспорт

	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ 
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеДанныхВычета

// Конструктор параметров записи данных стандартных вычетов.
//
// Параметры:
//   Организация          - СправочникСсылка.Организации - Организация, для которой указывается вычет
//   НачалоПериода        - Дата - Начало периода действия вычета
//   КонецПериода         - Дата - Конец периода действия вычета
//   ИмяОбъектаМетаданных - Строка - Наименование регистра, напр. РегистрСведений.ИПСтандартныеВычетыНаДетей
//
// Возвращаемое значение:
//   Структура
//
Функция НовыйРеквизитыЗаписиВычета(Организация, НачалоПериода, КонецПериода, ИмяОбъектаМетаданных) Экспорт
	
	РеквизитыЗаписи = Новый Структура;
	РеквизитыЗаписи.Вставить("Организация",  Организация);                  // СправочникСсылка.Организации
	РеквизитыЗаписи.Вставить("Период",       НачалоПериода);                // Дата
	РеквизитыЗаписи.Вставить("КонецПериода", КонецПериода);                 // Дата
	РеквизитыЗаписи.Вставить("ИмяОбъектаМетаданных", ИмяОбъектаМетаданных); // Строка - Наименование регистра, напр. РегистрСведений.ИПСтандартныеВычетыНаДетей
	
	Возврат РеквизитыЗаписи;
	
КонецФункции

// Выполняет запись данных в регистр стандартных вычетов
//
// Параметры:
//   ПараметрыВычета - ТаблицаЗначений - Данные для записи в регистр.
//   РеквизитыЗаписи - Структура - см. НовыйРеквизитыЗаписиВычета()
//
Процедура СохранитьСтандартныйВычетЗаПериод(ПараметрыВычета, РеквизитыЗаписи) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ 
	
КонецПроцедуры

#КонецОбласти

#Область РасчетСуммыВычета

// Конструктор параметров расчета суммы стандартного вычета.
//
// Возвращаемое значение:
//   Структура
//
Функция НовыйПараметрыВычета() Экспорт
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Организация");              // СправочникСсылка.Организации
	СтруктураРезультат.Вставить("НачалоПериода");            // Дата
	СтруктураРезультат.Вставить("КонецПериода");             // Дата
	СтруктураРезультат.Вставить("КоличествоМесяцев", 0);     // Число - Количество месяцев применения вычета
	СтруктураРезультат.Вставить("ВыбраннаяФорма", "");       // Имя формы регламентированного отчета для Декларации 3-НДФЛ
	СтруктураРезультат.Вставить("ВычетЗаВесьПериод", Ложь);  // Булево
	СтруктураРезультат.Вставить("ИмяОбъектаМетаданных", ""); // Строка - Полное имя объекта метаданного (напр., РегистрСведений.ИПСтандартныеВычетыНаДетей)
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Конструктор параметров расчета суммы стандартного вычета.
//
// Параметры:
//   Организация       - СправочникСсылка.Организации - Организация, для которой применяется вычет
//   НачалоПериода     - Число - Дата начала периода расчета вычета
//   КонецПериода      - Дата - Конец периода расчета вычета
//   ВыбраннаяФорма    - Строка - наименование формы отчета для Декларации 3-НДФЛ
//
// Возвращаемое значение:
//   Структура
//
Функция НовыеПараметрыРасчетаДоходыИРасходыПредпринимателя(Организация, НачалоПериода, КонецПериода, ВыбраннаяФорма) Экспорт
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",                  Организация);    // СправочникСсылка.Организации
	ПараметрыРасчета.Вставить("НачалоПериода",                НачалоПериода);  // Дата
	ПараметрыРасчета.Вставить("КонецПериода",                 КонецПериода);   // Дата
	ПараметрыРасчета.Вставить("ВыбраннаяФорма",               ВыбраннаяФорма); // Форма отчета Декларация 3-НДФЛ
	ПараметрыРасчета.Вставить("УникальныйИдентификаторФормы", "");             // Строка
	
	Возврат ПараметрыРасчета;
	
КонецФункции

// Возвращает рассчитанные значения согласно КУДиР ИП за период:
//  - сумма доходов
//  - сумма расходов
//  - сумма предела для применения стандартного вычета на детей
//  - количество месяцев, для которых применяется стандартный вычет на детей
//
// Параметры:
//   ПараметрыВыполнения - Структура - см. НовыеПараметрыРасчетаДоходыИРасходыПредпринимателя()
//
// Возвращаемое значение:
//   Структура - см. НовыйРезультатРасчетаДоходыРасходыПредпринимателя()
//
Функция СведенияОДоходахИВычетах(ПараметрыВыполнения) Экспорт
	
	ДанныеРезультат = НовыйРезультатРасчетаДоходыРасходыПредпринимателя();
	
	// ДЕНЬГИ код исключен
	
	Возврат ДанныеРезультат;
	
КонецФункции

// Возвращает таблицу с данными о вычетах помесячно за выбранный период.
//
// Параметры:
//   ПараметрыВыполнения - Структура - см. НовыйПараметрыВычета()
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ДанныеВычетаПоМесяцамЗаПериод(ПараметрыВыполнения) Экспорт
	
	// ДЕНЬГИ - код исключен, т.к. нет регистров учета ИП
	ДанныеВычетов = НовыйТаблицаВычетаЗаПериод(ПараметрыВыполнения.Организация, ПараметрыВыполнения.НачалоПериода); // ДЕНЬГИ 
	
	ДанныеВычетов.Колонки.Добавить("СуммаВычета", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	ДанныеВычетов.Колонки.Добавить("Месяц", ОбщегоНазначения.ОписаниеТипаСтрока(8));  // Представление месяца
	
	МесяцНачало = 1;
	МесяцКонец  = Месяц(ПараметрыВыполнения.КонецПериода);
	
	// Добавим недостающие периоды в таблицу по действующим данным
	ДобавитьНедостающиеПериодыВТаблицу(ДанныеВычетов, МесяцКонец);
	
	// Удалим строку с данными предыдущего отчетного периода
	СтрокаПредыдущийПериод = ДанныеВычетов.Найти(0, "НомерМесяца");
	Если ЗначениеЗаполнено(ДанныеВычетов) И СтрокаПредыдущийПериод <> Неопределено Тогда
		ДанныеВычетов.Удалить(СтрокаПредыдущийПериод);
	КонецЕсли;
	
	// Отсортируем данные по порядку
	ДанныеВычетов.Сортировать("НомерМесяца");
	
	Если ПараметрыВыполнения.ВычетЗаВесьПериод Тогда
		КоличествоМесяцев = МесяцКонец - МесяцНачало + 1;
	Иначе
		КоличествоМесяцев = ПараметрыВыполнения.КоличествоМесяцев;
	КонецЕсли;
	
	// Расчет суммы вычета с учетом количества месяцев к применению
	Для Каждого ТекущаяСтрока Из ДанныеВычетов Цикл
		
		Если ТекущаяСтрока.НомерМесяца <= КоличествоМесяцев Тогда
			ТекущаяСтрока.СуммаВычета = 0; // ДЕНЬГИ МенеджерОбъекта.РазмерТекущегоВычета(ТекущаяСтрока, РазмерыВычетов);
		КонецЕсли;
		
		ТекущаяСтрока.Месяц = ДеньгиКлиентСервер.ПредставлениеМесяца(ТекущаяСтрока.НомерМесяца);
		
	КонецЦикла;
	
	Возврат ДанныеВычетов;
	
КонецФункции

// Возвращает сумму вычета за выбранный период.
//
// Параметры:
//   ПараметрыВыполнения - Структура - см. НовыйПараметрыВычета()
//
// Возвращаемое значение:
//   Число
//
Функция СуммаСтандартногоВычета(ПараметрыВыполнения) Экспорт
	
	СуммаВычета   = 0;
	ТаблицаДанных = ДанныеВычетаПоМесяцамЗаПериод(ПараметрыВыполнения);
	
	Если ЗначениеЗаполнено(ТаблицаДанных) Тогда
		СуммаВычета = ТаблицаДанных.Итог("СуммаВычета");
	КонецЕсли;
	
	Возврат СуммаВычета;
	
КонецФункции

// Рассчитывает сумму профессионального вычета, на который имеет право предприниматель
//
// Параметры:
//   СуммаРасходов                - Число - Сумма подтвержденных расходов по данным КУДиР ИП
//   СуммаДоходов                 - Число - Сумма подтвержденных доходов по данным КУДиР ИП
//   ВыбраннаяФорма               - Строка - Имя действующей формы декларации 3-НДФЛ на период расчета налога
//   ЭтоЗавершающийОтчетныйПериод - Булево - Признак, указывающий, является ли период расчета налога завершающим в налоговом периоде
//
// Возвращаемое значение:
//   Число
//
Функция СуммаПрофессиональногоВычета(СуммаРасходов, СуммаДоходов, ВыбраннаяФорма, ЭтоЗавершающийОтчетныйПериод) Экспорт
	
	Если ЭтоЗавершающийОтчетныйПериод И СуммаРасходов = 0 Тогда
		// Абз. 4 п. 1 ст. 221 НК РФ
		// Если ИП не в состоянии документально подтвердить свои расходы,
		// профессиональный налоговый вычет производится в размере 20% общей суммы доходов
		КоэффициентВычета = Отчеты.РегламентированныйОтчет3НДФЛ.ПроцентПрофессиональногоВычета(ВыбраннаяФорма) / 100;
		Результат = СуммаДоходов * КоэффициентВычета;
	Иначе
		Результат = СуммаРасходов;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДеньУплатыАвансовогоПлатежаПоУмолчанию()
	
	Возврат 25;
	
КонецФункции

Процедура ДобавитьНедостающиеПериодыВТаблицу(ДанныеВычетов, КоличествоМесяцев)
	
	// Если в таблице вычетов не добавлены все строки по месяцам,
	// тогда следует добавить значения, исходя из данных действующих периодов
	Если КоличествоМесяцев >= ДанныеВычетов.Количество() Тогда
		
		Для Каждого ТекущаяСтрока Из ДанныеВычетов Цикл
			
			НомерМесяцаСледующий = ТекущаяСтрока.НомерМесяца + 1;
			// Проверим, есть ли в таблице месяц, следующий за текущим:
			// если нет, тогда добавим строку в таблицу вычетов, исходя их данных текущей строки
			Если НомерМесяцаСледующий <= КоличествоМесяцев
				И ДанныеВычетов.Найти(НомерМесяцаСледующий, "НомерМесяца") = Неопределено Тогда
				
				НоваяСтрока = ДанныеВычетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.НомерМесяца = НомерМесяцаСледующий;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НоваяТаблицаРасчетовПоНалогу()
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	
	ТаблицаРасчетов.Колонки.Добавить("НалоговыйПериод", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРасчетов.Колонки.Добавить("Начислено", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаРасчетов.Колонки.Добавить("Уплачено", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаРасчетов.Колонки.Добавить("Переплата", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаРасчетов.Колонки.Добавить("Задолженность", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция НоваяТаблицаСправкиРасчетаНалога()
	
	ТипСтандартнаяСумма                = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	ТипСтандартнаяСуммаНеотрицательная = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный);
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ПериодРасчета", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Результат.Колонки.Добавить("СтавкаНалога",  ОбщегоНазначения.ОписаниеТипаЧисло(5, 2, ДопустимыйЗнак.Неотрицательный));
	Результат.Колонки.Добавить("Доходы",                ТипСтандартнаяСумма);
	Результат.Колонки.Добавить("ВидВычета",             Новый ОписаниеТипов("ПеречислениеСсылка.ВычетыФизическихЛиц"));
	Результат.Колонки.Добавить("СуммаВычета",           ТипСтандартнаяСумма);
	Результат.Колонки.Добавить("НалоговаяБаза",         ТипСтандартнаяСуммаНеотрицательная);
	Результат.Колонки.Добавить("НалогИсчисленныйВсего", ТипСтандартнаяСумма);
	Результат.Колонки.Добавить("АвансовыеПлатежи",      ТипСтандартнаяСуммаНеотрицательная);
	Результат.Колонки.Добавить("НалогКУплате",          ТипСтандартнаяСумма);
	Результат.Колонки.Добавить("Переплата",             ТипСтандартнаяСумма);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйРезультатРасчетаДоходыРасходыПредпринимателя()
	
	ДанныеРезультат = Новый Структура;
	ДанныеРезультат.Вставить("Доходы", 0);
	ДанныеРезультат.Вставить("Расходы", 0);
	ДанныеРезультат.Вставить("КоличествоМесяцевВычетНаДетей", 0);
	ДанныеРезультат.Вставить("ПределВычетаНаДетейДоходы", 0);
	ДанныеРезультат.Вставить("ПрочиеДоходы", 0);
	
	Возврат ДанныеРезультат;
	
КонецФункции

Процедура РассчитатьНДФЛ(КонтекстРасчета, ТаблицаПроводок, ТаблицаСправкиРасчета)
	
	Если КонтекстРасчета.Период < ДатаНачалаРасчетаАвансовыхПлатежейНДФЛ() Тогда
		Возврат;
	КонецЕсли;
	
	СчетНачисленияНалога = "68.21"; // ДЕНЬГИ ПланыСчетов.Хозрасчетный.НДФЛ_ИП;              // Кт 68.21
	СчетОтраженияНалога  = "99.01.1"; // ДЕНЬГИ ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД; // Дт 99.01.1
	
	РазрядностьОкругленияПоказателей = Деньги3НДФЛ.РазрядностьОкругленияПоказателейПриРасчетеНалога(КонтекстРасчета.Период);
	
	// Расчет доходов и расходов
	
	ПараметрыРасчета = НовыеПараметрыРасчетаДоходыИРасходыПредпринимателя(
		КонтекстРасчета.Организация,
		КонтекстРасчета.НачалоНалоговогоПериода,
		КонтекстРасчета.КонецОтчетногоПериода,
		КонтекстРасчета.ИмяФормыДекларации3НДФЛ);
	
	ДоходыРасходы = СведенияОДоходахИВычетах(ПараметрыРасчета);
	
	Доходы                       = ДоходыРасходы.Доходы;
	ИсчисленоЗаПредыдущиеПериоды = 0;
	
	// Стандартные вычеты
	
	ПараметрыВычета = НовыйПараметрыВычета();
	ПараметрыВычета.НачалоПериода     = КонтекстРасчета.НачалоНалоговогоПериода;
	ПараметрыВычета.КонецПериода      = КонтекстРасчета.КонецОтчетногоПериода;
	ПараметрыВычета.Организация       = КонтекстРасчета.Организация;
	ПараметрыВычета.ВыбраннаяФорма    = КонтекстРасчета.ИмяФормыДекларации3НДФЛ;
	ПараметрыВычета.ВычетЗаВесьПериод = Истина;
	ПараметрыВычета.ИмяОбъектаМетаданных = "РегистрСведений.ИПСтандартныеВычетыНаНалогоплательщика";
	
	СтандартныйВычетНаНалогоплательщика = СуммаСтандартногоВычета(ПараметрыВычета);
	
	ПараметрыВычета.ИмяОбъектаМетаданных = "РегистрСведений.ИПСтандартныеВычетыНаДетей";
	ПараметрыВычета.КоличествоМесяцев = ДоходыРасходы.КоличествоМесяцевВычетНаДетей;
	ПараметрыВычета.ВычетЗаВесьПериод = Ложь;
	СтандартныйВычетНаДетей = СуммаСтандартногоВычета(ПараметрыВычета);
	
	СтандартныйВычет = СтандартныйВычетНаДетей + СтандартныйВычетНаНалогоплательщика;
	
	// Расчет налога
	
	СуммаВычетов = ДоходыРасходы.Расходы + СтандартныйВычет;
	
	Если Не КонтекстРасчета.ЭтоПервыйОтчетныйПериод Тогда
		
		КонецПредыдущегоКвартала = НачалоКвартала(КонтекстРасчета.КонецОтчетногоПериода) - 1;
		ИсчисленоЗаПредыдущиеПериоды = НачисленныйНалогЗаПериод(КонтекстРасчета.Организация,
			КонтекстРасчета.НачалоНалоговогоПериода, КонецПредыдущегоКвартала);
		
	КонецЕсли;
	
	НалоговаяБаза = Доходы - СуммаВычетов;
	НалогСНачалаГодаВсего = Окр(НалоговаяБаза * КонтекстРасчета.СтавкаНалога / 100, РазрядностьОкругленияПоказателей);
	НалогКУплате = Окр(НалогСНачалаГодаВсего - ИсчисленоЗаПредыдущиеПериоды, РазрядностьОкругленияПоказателей);
	
	// Данные для проводки по начислению налога
	Если НалоговаяБаза > 0 И НалогКУплате <> 0 Тогда
		
		СтрокаПроводки = ТаблицаПроводок.Добавить();
		
		СтрокаПроводки.СчетДт                 = СчетОтраженияНалога;
		СтрокаПроводки.СчетКт                 = СчетНачисленияНалога;
		СтрокаПроводки.ПрибылиИУбытки         = "НалогНаПрибыль"; // ДЕНЬГИ Перечисления.ПрибылиИУбытки.НалогНаПрибыль;
		СтрокаПроводки.ВидыПлатежейВГосБюджет = "Налог"; // ДЕНЬГИ Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СтрокаПроводки.Сумма                  = НалогКУплате;
		СтрокаПроводки.Содержание             = СодержаниеПроводкиНачислениеНалога(КонтекстРасчета, НалогКУплате);
		
	КонецЕсли;
	
	// Запись справки-расчета по налогу
	СтрокаСправки = ТаблицаСправкиРасчета.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаСправки, КонтекстРасчета);
	
	СтрокаСправки.ПериодРасчета         = КонтекстРасчета.Период;
	СтрокаСправки.Доходы                = Доходы;
	СтрокаСправки.НалоговаяБаза         = НалоговаяБаза;
	СтрокаСправки.НалогИсчисленныйВсего = НалогСНачалаГодаВсего;
	СтрокаСправки.АвансовыеПлатежи      = ИсчисленоЗаПредыдущиеПериоды;
	
	Если НалогКУплате > 0 Тогда
		СтрокаСправки.НалогКУплате      = НалогКУплате;
	ИначеЕсли НалоговаяБаза > 0 Тогда
		СтрокаСправки.Переплата         = -НалогКУплате;
	КонецЕсли;
	
	СтрокаСправки = ТаблицаСправкиРасчета.Добавить();
	СтрокаСправки.ПериодРасчета = КонтекстРасчета.Период;
	СтрокаСправки.СтавкаНалога  = КонтекстРасчета.СтавкаНалога;
	СтрокаСправки.ВидВычета     = Перечисления.ВычетыФизическихЛиц.Профессиональный;
	СтрокаСправки.СуммаВычета   = ДоходыРасходы.Расходы;
	
	СтрокаСправки = ТаблицаСправкиРасчета.Добавить();
	СтрокаСправки.ПериодРасчета = КонтекстРасчета.Период;
	СтрокаСправки.СтавкаНалога  = КонтекстРасчета.СтавкаНалога;
	СтрокаСправки.ВидВычета     = Перечисления.ВычетыФизическихЛиц.СтандартныйНаДетей;
	СтрокаСправки.СуммаВычета   = СтандартныйВычетНаДетей;
	
	СтрокаСправки = ТаблицаСправкиРасчета.Добавить();
	СтрокаСправки.ПериодРасчета = КонтекстРасчета.Период;
	СтрокаСправки.СтавкаНалога  = КонтекстРасчета.СтавкаНалога;
	СтрокаСправки.ВидВычета     = Перечисления.ВычетыФизическихЛиц.СтандартныйНаНалогоплательщика;
	СтрокаСправки.СуммаВычета   = СтандартныйВычетНаНалогоплательщика;
	
	// Если организация попадает под условия освобождения уплаты налога, тогда делаем дополнительную проводку
	Если НалогКУплате > 0 И ПрименяетсяОсвобождениеОтНалога(КонтекстРасчета.Организация, КонтекстРасчета.Период) Тогда
		
		// ДЕНЬГИ код исключен
		
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйПараметрыОтраженияНачисленийПоНДФЛ()
	
	Результат = Новый Структура;
	Результат.Вставить("Период");
	Результат.Вставить("КонецОтчетногоПериода");
	Результат.Вставить("НачалоГода");
	Результат.Вставить("Счет");
	Результат.Вставить("ЭтоЗавершающийОтчетныйПериод", Ложь);
	Результат.Вставить("СтавкаНалога", 0);
	Результат.Вставить("НалогИсчисленныйВсего", 0);
	Результат.Вставить("АвансовыеПлатежи", 0);
	Результат.Вставить("Доходы", 0);
	Результат.Вставить("НалоговаяБаза", 0);
	Результат.Вставить("Сумма", 0);
	
	Возврат Результат;
	
КонецФункции

Функция СодержаниеПроводкиНачислениеНалога(Реквизиты, НалогКУплате = 0)
	
	Содержание = "";
	
	ПредставлениеПериода = ПредставлениеПериода(Реквизиты.НачалоГода, Реквизиты.КонецОтчетногоПериода, "ФП=Истина");
	
	Если Реквизиты.ЭтоЗавершающийОтчетныйПериод Тогда
		Содержание = СтрШаблон(НСтр("ru = 'Начислен налог на доходы физических лиц за %1'"), ПредставлениеПериода);
	Иначе
		Содержание = СтрШаблон(НСтр("ru = 'Начислен авансовый платеж по налогу на доходы физических лиц за %1'"), 
			ПредставлениеПериода);
	КонецЕсли;
	
	Возврат Содержание;
	
КонецФункции

// ДЕНЬГИ 
Функция НовыйТаблицаВычетаЗаПериод(Организация = Неопределено, НачалоПериода = Неопределено)
	
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("НомерМесяца", ТипЧисло);
	Результат.Колонки.Добавить("Организация");
	Результат.Колонки.Добавить("ВсегоДетей", ТипЧисло);
	Результат.Колонки.Добавить("Несовершеннолетних", ТипЧисло);
	Результат.Колонки.Добавить("РодныеДетиИнвалиды", ТипЧисло);
	Результат.Колонки.Добавить("ПриемныеДетиИнвалиды", ТипЧисло);
	Результат.Колонки.Добавить("ПрименяетсяДвойнойВычет", Новый ОписаниеТипов("Булево"));
	
	НачГода = ?(ЗначениеЗаполнено(НачалоПериода), НачалоГода(НачалоПериода), НачалоГода(ТекущаяДата()));
	Для Счетчик = 1 По 12 Цикл
		СтрокаВычета = Результат.Добавить();
		СтрокаВычета.Период      = НачалоМесяца(ДобавитьМесяц(НачГода, Счетчик));
		СтрокаВычета.НомерМесяца = Счетчик;
		СтрокаВычета.Организация = Организация;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
